const ar = {
  lang: {
    es: "الإسبانية",
    ca: "الكتالونية",
    en: "الإنجليزية",
    zh_CN: "الصينية",
    ar: "العربية",
    it: "الإيطالية",
    fr: "الفرنسية",
    de: "الألمانية",
    pt_PT: "البرتغالية",
    ru: "الروسية",
    pl: "البولندية",
    nl: "الهولندية",
    ja: "اليابانية",
  },
  network: {
    offline: "لا يوجد اتصال بالإنترنت.",
  },
  generic: {
    yes: "نعم",
    no: "لا",
    cancel: "إلغاء",
  },
  pages: {
    home: "الرئيسية",
    search: "بحث",
    favorites: "المفضلات",
    playlists: "قوائم التشغيل",
  },
  search: {
    start: "ماذا تريد أن تستمع إليه؟",
    error: "خطأ أثناء إجراء البحث في السحابة.",
    noResults: "لم يتم العثور على نتائج.",
    all: "الكل",
    music: "موسيقى",
  },
  favorites: {
    no_results: "عذراً! يبدو أنني لا أستطيع العثور على أي شيء.",
    start: "أليس لديك أي مفضلات حتى الآن؟ :O",
    spotify: "استيراد من سبوتيفاي",
    delete: {
      header: "حذف المفضلة",
      message: "هل أنت متأكد أنك تريد حذف {title} من مفضلاتك؟",
    },
    download: {
      header: "تحميل المفضلات",
      message:
        "هل أنت متأكد أنك تريد تحميل جميع مفضلاتك؟ تأكد من وجود مساحة كافية على جهازك!",
    },
  },
  playlist: {
    alreadyDownloaded: "تم تنزيل التحديد بالفعل.",
  },
  settings: {
    language: "اللغة",
    theme: "المظهر",
  },
  errors: {
    audio_unplayable: "لا يمكن تشغيل هذا الصوت.",
    src_error: "حدث خطأ أثناء تشغيل الصوت.",
  },
  spotify: {
    link: "ربط سبوتيفاي",
    unlink: "إلغاء ربط سبوتيفاي",
    starting_import: "جاري بدء استيراد سبوتيفاي...",
    favorites: {
      importing: "جاري استيراد مفضلات سبوتيفاي ({0} من {1})",
    },
  },
  update: {
    title: "تحديث متوفر!",
    message: "الإصدار {0} متوفر. هلودك تنزيله؟",
  },
};

export default ar;
