const ru = {
  lang: {
    es: "Испанский",
    ca: "Каталанский",
    en: "Английский",
    zh_CN: "Китайский",
    ar: "Арабский",
    it: "Итальянский",
    fr: "Французский",
    de: "Немецкий",
    pt_PT: "Португальский",
    ru: "Русский",
    pl: "Польский",
    nl: "Нидерландский",
    ja: "Японский",
  },
  network: {
    offline: "Нет подключения к интернету.",
  },
  generic: {
    yes: "Да",
    no: "Нет",
    cancel: "Отмена",
  },
  pages: {
    home: "Главная",
    search: "Поиск",
    favorites: "Избранное",
    playlists: "Плейлисты",
  },
  search: {
    start: "Что бы вы хотели послушать?",
    error: "Ошибка при выполнении поиска в облаке.",
    noResults: "Результаты не найдены.",
    all: "Все",
    music: "Музыка",
  },
  favorites: {
    no_results: "Ой! Кажется, ничего не найдено.",
    start: "У вас еще нет избранного? :O",
    spotify: "Импорт из Spotify",
    delete: {
      header: "Удалить из избранного",
      message: "Вы уверены, что хотите удалить {title} из избранного?",
    },
    download: {
      header: "Скачать избранное",
      message:
        "Вы уверены, что хотите скачать все элементы из избранного? Убедитесь, что на вашем устройстве достаточно свободного места!",
    },
  },
  playlist: {
    alreadyDownloaded: "Выбор уже был загружен.",
  },
  settings: {
    language: "Язык",
    theme: "Тема",
    cache: "Очистить кэш",
    cache_cleared: "Аудио из кэша удалено.",
    erase_all: "Удалить всё",
    erase: {
      header: "Удалить все данные",
      message:
        "Вы уверены, что хотите удалить всё и вернуться к начальному状態? Это нельзя отменить.",
    },
  },
  errors: {
    audio_unplayable: "Это аудио не может быть воспроизведено.",
    src_error: "Ошибка воспроизведения аудио.",
  },
  spotify: {
    link: "Подключить Spotify",
    unlink: "Отключить Spotify",
    unlinked: "Аккаунт Spotify отсоединён.",
    not_linked: "Нет привязанного аккаунта Spotify.",
    starting_import: "Запуск импорта...",
    favorites: {
      importing: "Импорт избранного... ({0} из {1})",
    },
  },
  update: {
    title: "Доступно обновление!",
    message: "Доступна версия {0}. Хотите ее скачать?",
  },
};

export default ru;
